<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"d73192b03863910b55c9b3a5fb46b513e850e2baea47f1bc5881fefe09be99c7","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1214 at https://github.com/cal-itp/data-infra/actions/runs/20318262842","plan_out_hash":"46b15bbdef8c8d3eb5cc73f603758d03f587644811241acaf2b7c153bd3c3c27","plan_hash":"8fe4415140aa4d3b7e794b66309f3046119f3198d29bedece7d778e3d90d6dcc","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 4 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["dags/dbt_manual_dag.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "/SQyEw==" -> (known after apply)
!~      detect_md5hash      = "PS6O2bAmQG8Pmb24efxDgA==" -> "different hash"
!~      generation          = 1763685485222363 -> (known after apply)
        id                  = "calitp-staging-composer-dags/dbt_manual_dag.py"
!~      md5hash             = "PS6O2bAmQG8Pmb24efxDgA==" -> (known after apply)
        name                = "dags/dbt_manual_dag.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "PRjcFQ==" -> (known after apply)
!~      detect_md5hash      = "QfSKNkyBTlKIiB0tCjBUTw==" -> "different hash"
!~      generation          = 1765993237386170 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "QfSKNkyBTlKIiB0tCjBUTw==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/intermediate/gtfs/int_gtfs_rt__trip_updates_trip_stop_day_map_grouping.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "b+mqng==" -> (known after apply)
!~      detect_md5hash      = "yJUh/Od0p1Q4ScChXQ1Y1g==" -> "different hash"
!~      generation          = 1758311278732540 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/intermediate/gtfs/int_gtfs_rt__trip_updates_trip_stop_day_map_grouping.sql"
!~      md5hash             = "yJUh/Od0p1Q4ScChXQ1Y1g==" -> (known after apply)
        name                = "data/warehouse/models/intermediate/gtfs/int_gtfs_rt__trip_updates_trip_stop_day_map_grouping.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "9qQfzw==" -> (known after apply)
!~      detect_md5hash      = "GOLEy+jzhAvlXFrOo3h98Q==" -> "different hash"
!~      generation          = 1765993238851246 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "GOLEy+jzhAvlXFrOo3h98Q==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 4 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1214](https://github.com/cal-itp/data-infra/actions/runs/20318262842)